In [ ]:
https://www.pgadmin.org/docs/pgadmin4/6.17/index.html
String function
Mathematical function

Data types
postgresql.org/docs/current/datatype.html

In [ ]:
BETWEEN
IN
EXIST
ORDER BY

In [2]:
SELECT DISTINCT -- selects unique rows from column
SELECT COUNT(DISTINCT column name) -- counts number of rows
ORDER BY column name1 ASC, colummn name2 DESC -- sorts by order
LIMIT number_of_column -- always at end of query, gives mention amount of rows 
BETWEEN/ NOT BETWEEN -- gives value in range, BETWEEN is inclusive and NOT BETWEEN is exclusive, BETWEEN v1 AND v2
                        during using this on dates with time be careful with time 
column_name IN/ NOT IN (value1, value2) -- in values its OR logic
NOT LIKE/ LIKE case-sensitive, ILIKE case-insensitive -- '_J%', WHERE col_name LIKE '%a'
UNION -- stacks vertically

In [ ]:
Aggregate Functions-
Works only in SELECT claude or HAVING clause

AVG() -- returns floating value, can use ROUND() for precision value
COUNT()
MAX()
MIN()
SUM()

In [ ]:
ROUND(value, numbers after decimal needed), ROUND(AVG(Col1), 2)
GROUP BY column_name -- use after FROM or WHERE
                        column name mentioned in SELECT should also be mentioned in GROUPBY
                        Only exception is when the mentioned column in SELECT has aggregate function on it
GROUP BY ON DATE -- In SELECT pass date_column as DATE(column_name) then use GROUPBY on whole function
HAVING -- HAVING SUM(column_name) > 10, Use after GroupBy, used for aggregate functions
AS -- Alias, gets executed at the end of query, only works in SELECT statement

In [ ]:
JOINS

INNER JOIN -- will result set of records that match in both tables 

syntax -- 
 SELECT * FROM TableA
 INNER JOIN TableB
 ON TableA.col_match = TableB.col_match

In [ ]:
OUTER JOIN -- Selects everything from both tables, missing values are replaced with null

syntax --
 SELECT * FROM TableA
 FULL OUTER JOIN TableB
 ON TableA.col_match = TableB.col_match
    
To get unique values aka opposite of Inner join values
Use WHERE 
syntax -- 
 SELECT * FROM Registeration FULL OUTER JOIN Logins
 ON Registerations.name = Login.name
 WHERE Registeration.reg_id IS null OR Login.login_id IS null

In [ ]:
LEFT OUTER JOIN -- All values in left table, matching values in both table A and B,
                   if no match in right then value is returned null
RIGHT OUTER JOIN -- opposite of LEFT OUTER JOIN

In [ ]:
SELF JOIN -- joins on same table
syntax -- 
 SELECT tableA.col,tableB.col
 FROM table AS tableA
 JOIN table AS tableB ON
 tableA.some_col = tableB.other_col

In [ ]:
TIME -- contains only time
DATE -- Contains only date
TIMESTAMP -- Contains date and time
TIMESTAMPTZ -- Contains date, time and timezone

In [ ]:
SHOW TIMEZONE -- Shows time zone
SELECT NOW() -- Current timestamp information
SELECT TIMEOFDAY() -- Same as SELECT NOW() but in more readable format
SELECT CURRENT_TIME -- gives current time
SELECT CURRENT_DATE -- gives current date

In [ ]:
EXTRACT()
Allows to extract or obtain a sub-component of a date value
- YEAR -- SELECT EXTRACT(YEAR FROM date_col)
- MONTH
- DAY
- WEEK
- QUARTER

AGE()
Calculates and returns the current age given a timestamp
-- SELECT AGE(date_col)
OUTPUT- 13 years 1mon 5 days 01:34:13.003423

TO_CHAR()
- General function to convert data types to text
- Useful for timestamp formatting
-- SELECT TO_CHAR(date_col,'mm-dd-yyyy')
Google TO_CHAR() for more 'mm-dd-yyyy' formatting

In [ ]:
To get weekday -- EXTRACT(dow FROM payment_date) = 1 #0 is sunday
|| -- concatenate

In [ ]:
COLUMN CONSTRAINTS -- 
NOT NULL
UNIQUE
PRIMARY KEY
FOREIGN KEY
CHECK -- Ensures all values in a column staisfy certain conditions
EXCLUSION

In [ ]:
TABLE CONSTRAINTS -- 
CHECK
REFERENCES
UNIQUE(column_list)
PRIMARY KEY(column_list)

In [ ]:
CREATE TABLE -- 
CREATE TABLE table_name(
column_name TYPE column_constraint,
column_name TYPE column_constraint,
table_constraint table_constraint) INHERITS existing_table_name;

In [ ]:
REFERENCE -- user_id INTEGER REFERENCES account(user_id) INTEGER because serial is used in another table

INSERT -- 
 INSERT INTO table_name(col1, col2, col3, col4)
 VALUES
 ('value for col1', 'value for col2', 'value for col3', CURRENT_TIMESTAMP)

In [ ]:
UPDATE
syntax-

Gernal --
 UPDATE table_name
 SET col1 = value1,
     col2 = value2,
 WHERE
     condition;

To override everything in that column -- 
 UPDATE table_name
 SET col1 = val1;

Set based on another column -- 
 UPDATE table_name
 SET col1 = col2;

UPDATE JOIN -- update values from another table
 UPDATE table_name
 SET original_col = TableB.new_col
 FROM tableB
 WHERE tableA.id = TableB.id

Return affected rows -- 
 UPDATE table_name
 SET col1 = col2
 RETURNING col, col
Returning returns the updated columns

In [ ]:
DELETE

to remove rows from table
 DELETE FROM table_name
 WHERE col_value = 1

delete rows based on their presence in other tables(DELETE JOIN)
 DELETE FROM tableA
 USING tableB
 WHERE tableA.id=TableB.id

to delete all rows 
 DELETE FROM table_name

 RETURNING col, col
Returning returns the updated columns

ALTER -- Helps changing properties of tables

syntax--
 ALTER TABLE table_name
 RENAME TO new_table_name                      #renames table name
 RENAME COLUMN old_column  TO new_column_name  #renames column name
 
To alter constraints
 ALTER TABLE table_name
 ALTER COLUMN column_name SET/DROP NOT NULL
 
CHECK DOCUMENTATION FOR MORE INFO

In [ ]:
DROP -- allows to completely remove column
syntax--
 ALTER TABLE table_name
 DROP COLUMN column_name

To drop multiple columns
 ALTER TABLE table_name
 DROP COLUMN column_name,
 DROP COLUMN column_name2

To remove all dependencies
 ALTER TABLE table_name
 DROP COLUMN col_name CASCADE

To avoid existence error-- Use IF EXISTS
 ALTER TABLE table_name
 DROP COLUMN IF EXISTS col_name

In [ ]:
CHECK CONSTRAINT -- Allows you to add condition while creating tables, while inserting values into this table, if 
                    doesnt meet constraints then throws errors.
syntax-- 
 CREATE TABLE table_name(
 ex_id SERIAL PRIMARY KEY,
 age SMALLINT CHECK (age>21),
 parent_age SMALLINT CHECK (parent_age>age));

In [ ]:
CASE -- Execute SQL code only when certain conditions are met, just like IF/ELSE statements
general syntax-- 
 CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    ELSE some_other_result
 END

Eg.
 SELECT name_col,
    CASE WHEN name_col = 'sam' THEN 'Topper'
         WHEN name_col = 'jack' THEN 'Failed'
    ELSE 'Passed' 
    END AS new_alias_name
 FROM test_table;
    
case expression syntax --
 CASE expression
    WHEN value1 THEN result1
    WHEN value2 THEN result2
    ELSE some_other_result
 END

Eg.
 SELECT name_col, 
    CASE name_col 
        WHEN 'same' THEN 'topper'
        WHEN 'jack' THEN 'Failed'
        ELSE 'Passed'
    END
 FROM test_table;

In [ ]:
COALESCE function -- substitutes null value with another value
syntax-- 
 SELECT col_name,(col1 + COALSECE(col2, your value like 1))
 AS final FROM table

In [ ]:
CAST function -- converts one data type to another
Works on entire column as well
General syntax--
 SELECT CAST('5' AS INTEGER)
    
PostgreSQL syntax -- 
 SELECT '5' :: INTEGER

In [ ]:
NULLIF Function -- Takes 2 inputs and returns NULL if both are equal, otherwise returns first arguement passed
syntax--
 NULLIF(10,10)
 returns NULL
 
 NULLIF(10,12)
 returns 10

In [ ]:
VIEWS --  converts a complex query into a virtual table, instead of writing whole query to get a table, just call the view
Eg. SELECT col1, col2 FROM table1
 With Views 
    SELECT * FROM views  -- views = SELECT col1, col2 FROM table1
    
syntax -- 
 CREATE VIEW name23 AS
 SELECT col1, col2, col3 FROM table1
 INNER JOIN col2
 ON table1.col3 = table1.col1
NEXT step
 SELECT * FROM name23
    
    
To update/replace a current view--
Use CREATE OR REPLACE VIEW instead of just CREATE VIEW

To delete a view -- 
 DROP VIEW view_name
    
To rename a view--
 ALTER VIEW old_view_name RENAME to new_view_name

In [ ]:
IMPORT & EXPORT

In [ ]:
LEETCODE NOTES-
<> -- not equal 
COALESCE() function #https://www.geeksforgeeks.org/use-of-coalesce-function-in-sql-server/